<?php
//© A.A.CheckMaRev assminog@gmail.com, tubmulur@yandex.ru, Hfic.Samin@vk.com 2021
function сПреобразовать($_сСтрока, $_сНаправление="вСтроку") //:вСтроку/вКоманду
	{
	$сСтрока		=$_сСтрока;
    
	if($_сНаправление=='вСтроку'||$_сНаправление=='вКоманду')
	    {
	    $сНаправление	=$_сНаправление;
		   unset($_сНаправление);
	    }
	$мПравилаПреобразования	=
		array(
		    "о18о"=> "http://",
		    "о19о"=> "https://",
		    "о20о"=> "<" ,
		    "о21о"=> ">" ,
		    "о60о"=> "«",
		    "о61о"=> "»", 
		    "о22о"=> "\"",
		    "о28о"=> "/" ,
		    "о29о"=> "\\",
		    "о24о"=> "?" ,
		    "о25о"=> "&" ,
		    "о26о"=> "=" ,
		    "о27о"=> " " ,
		    "о23о"=> "'" ,
		    "о40о"=> ",",  //
		    "о42о"=> "-",  //
		    "о43о"=> ".",  //
		    "о44о"=> "`",  //
		    "о55о"=> "´",
		    "о56о"=> "-",
		    "о57о"=> "~",
		    "о58о"=> ".",
		    "о59о"=> "’",
		    "о30о"=> ";",
		    "о32о"=> ":",
		    "о31о"=> "%",
		    "о33о"=> "[",  //To integrate
		    "о34о"=> "]",  //
		    "о35о"=> "(",  //To integrate
		    "о36о"=> ")",  //
		    "о62о"=> "{", 
		    "о63о"=> "}", 
		    "о37о"=> "?",  //To integrate
		    "о38о"=> "!",  //
		    "о39о"=> "*",  //
		    "о41о"=> "|",  //
		    "о45о"=> "~",  //
		    "о46о"=> "$",  //
		    "о47о"=> "#",  //
		    "о48о"=> "@",  //
		    "о49о"=> "+",  //
		    "о51о"=> "^",  //
		    "о52о"=> "%",  //
		    "о53о"=> "%",  //
		    "о54о"=> "№",  //63
		);
	foreach($мПравилаПреобразования as $сПреобразованноВКоманду=>$сПодлежитПреобразованиюВКоманду)
	    {
	    switch($сНаправление)
		{
		case 'вСтроку':
		    $сСтрока	=str_replace($сПреобразованноВКоманду, $сПодлежитПреобразованиюВКоманду, $сСтрока);
		break;
		case 'вКоманду':
		    $сСтрока	=str_replace($сПодлежитПреобразованиюВКоманду, $сПреобразованноВКоманду, $сСтрока);
		break;
		}
	    }
	return $сСтрока;
	}
?>