<?php
//© A.A.CheckMaRev assminog@gmail.com, tubmulur@yandex.ru, Hfic.Samin@vk.com 2021
function чРосХэш($_сВход) // 
	{
	$мСлово		=array();
	$сСлово		='';
	if($_сВход==='')
	    {
	    return 0;
	    }
    
	$ч1Длинна	=strlen($_сВход);
	$ч0Длинна	=($ч1Длинна-1);
	$чСумма		=0;
	
	for($ч0Шаг=0;$ч0Шаг<$ч1Длинна;$ч0Шаг++)
	    {
	    $чСумма		=($чСумма+ord($_сВход[$ч0Шаг]));
	
	    if(($ч0Шаг!=0&&$_сВход[$ч0Шаг]==" ")||($ч0Шаг==$ч0Длинна))
		{
		$чХэш		.=$чСумма.'Ф';
		$чСумма		=0;
		}
	    }
	return $чХэш;
	}
?>