<?php
//© A.A.CheckMaRev assminog@gmail.com, tubmulur@yandex.ru, Hfic.Samin@vk.com 2021
function мСобратьO2o($_сВход) // Слово
	{
	$мСлово		=array();
	$сСлово		='';
	if(empty($_сВход))
	    {
	    $мСлово[]='';
	    return $мСлово;
	    }
	
	$ч1Длинна	=strlen($_сВход);
	$ч0Длинна	=($ч1Длинна-1);
	
	for($ч0Шаг=0;$ч0Шаг<$ч1Длинна;$ч0Шаг++)
	    {
	    $сСлово.=$_сВход[$ч0Шаг];
	    //echo $ч0Шаг;
	    //echo '<br>';
	    if(
	    $ч0Шаг!=0&&
		(
		$_сВход[$ч0Шаг]=="_"||
		$_сВход[$ч0Шаг]=="."
		)
	    )
		{
		$сСлово		=substr($сСлово,0,-1);
		$мСлово[]	=$сСлово;
		$сСлово		='';
		//echo $ч0Шаг;
		//echo '<br>';
		}
	    if($ч0Шаг==$ч0Длинна)
		{
		$мСлово[]	=$сСлово;
		}
	    }
	if(!isset($мСлово[1]))
	    {
	    фОшибка($_сВход.'не даёт второго значения О2О');
	    }
	return $мСлово;
	}
?>